Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2025DAB288.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="r-------------------------------" edc:cname="Config4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config4" edc:nmmrflags="0d" edc:nmmrid="704" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="r------------------------------r" edc:cname="Config5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000001" edc:name="Config5" edc:nmmrflags="0e" edc:nmmrid="832" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NF" edc:desc="" edc:mask="0x1" edc:name="NF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="30"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="r-------------------------------" edc:cname="Config7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config7" edc:nmmrflags="0" edc:nmmrid="1088" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="WII" edc:desc="" edc:mask="0x1" edc:name="WII" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="----rrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="LLAddr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="LLAddr" edc:nmmrflags="0t" edc:nmmrid="196" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PAddr" edc:desc="" edc:mask="0xfffffff" edc:name="DSS" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo" edc:nmmrflags="0t" edc:nmmrid="200" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo1" edc:nmmrflags="0a" edc:nmmrid="328" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo2" edc:nmmrflags="0b" edc:nmmrid="456" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo3" edc:nmmrflags="0c" edc:nmmrid="584" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi" edc:nmmrflags="0t" edc:nmmrid="204" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi1" edc:nmmrflags="0a" edc:nmmrid="332" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi2" edc:nmmrflags="0b" edc:nmmrid="460" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi3" edc:nmmrflags="0c" edc:nmmrid="588" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
