Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2025DAB288.PIC
      <edc:SFRDef edc:_addr="0x1F8E80D8" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="24" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD26" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD26" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80DC" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="25" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD27" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD27" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80E0" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="26" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD28" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD28" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80E4" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="27" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD29" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD29" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80E8" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="28" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD210" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD210" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80EC" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="29" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD211" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD211" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80F0" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="30" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD212" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD212" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
